{
  "type": "bundle",
  "id": "bundle--example",
  "objects": [
    {
      "type": "attack-pattern",
      "id": "attack-pattern--1",
      "name": "PowerShell",
      "description": "Adversaries may abuse PowerShell commands and scripts for execution. PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code."
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--2",
      "name": "Windows Management Instrumentation",
      "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is an administration feature that provides a uniform environment to access Windows system components. The WMI service enables both local and remote access."
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--3",
      "name": "Credential Dumping",
      "description": "Credential dumping is the process of obtaining account login and password information, normally in the form of a hash or a clear text password, from the operating system and software. Credentials can then be used to perform lateral movement and access restricted information."
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--4",
      "name": "Data Exfiltration Over Web Service",
      "description": "Adversaries may use an existing, legitimate external Web service to exfiltrate data rather than their primary command and control channel. Popular Web services acting as an exfiltration mechanism may give a significant amount of cover due to the likelihood that hosts within a network are already communicating with them prior to compromise."
    },
    {
      "type": "malware",
      "id": "malware--1",
      "name": "Mimikatz",
      "description": "Mimikatz is a credential dumper capable of obtaining plaintext Windows account logins and passwords, along with many other features that make it useful for testing the security of networks."
    },
    {
      "type": "threat-actor",
      "id": "threat-actor--1",
      "name": "APT28",
      "description": "APT28 is a threat group that has been attributed to Russia's General Staff Main Intelligence Directorate (GRU) military unit 26165. This group has been active since at least 2004.  They typically use windows services as a persistence mechanism."
    },
    {
      "type": "tool",
      "id": "tool--1",
      "name": "PsExec",
      "description": "PsExec is a free Microsoft tool that can be used to execute a program on another computer. It is used by IT administrators and attackers."
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--5",
      "name": "Registry Run Keys / Startup Folder",
      "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the run keys in the Registry or startup folder will cause the program referenced to be executed when a user logs in."
    }
  ]
} 